// --створити масив та вивести його в консоль:
// - з 5 числових значень
// let number = [1, 2, 3, 4, 5];
// console.log(number[0]);
// console.log(number[1]);
// console.log(number[2]);
// console.log(number[3]);
// console.log(number[4]);
// console.log(number);


// - з 5 стічкових значень
// let str = ['dog', 'cat', 'car', 'doll', 'ball'];
// console.log(str[0]);
// console.log(str[1]);
// console.log(str[2]);
// console.log(str[3]);
// console.log(str[4]);
// console.log(str);

// - з 5 значень стрічкового, числового та булевого типу
// let group = ['dog', 25, true, false, 15];
// console.log(group[0]);
// console.log(group[1]);
// console.log(group[2]);
// console.log(group[3]);
// console.log(group[4]);
// console.log(group);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let empty = [];
// empty[5] = 'dog';
// empty.push(15);
// empty.unshift('cat')
// console.log(empty);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// let block = [];
// for (let i = 0; i<10; i++) {
// 	document.write('<div>Hello!</div>')
// }


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині 
// let block = [];

// for (let i = 1; i<=10; i++) {
// 	document.write(`<div>number${i}</div>`);
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// let block3 = [];
// let i = 0
// while (i<20) {
// 	document.write('<h1>Привіт</h1>');
// 	i++;
// }


// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let block4 = [];
// let i = 1
// while (i<=20) {
// 	document.write(`<h1>Привіт ${i}</h1>`);
// 	i++;
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// let masuv1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// for (let i=0; i<masuv1.length; i++) {
// 	console.log(masuv1[i]);
// }

// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// let masuv2 = ['o', 'w', 'e', 'r', 't', 'y', 't', 'g', 'd', 's'];
// for (let i=0; i<masuv2.length; i++) {
// 	console.log(masuv2[i]);
// }

// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let masuv3 = ['o', 1, true, 'r', 't', 99, 't', false, 'd', 's'];
// for (let i=0; i<masuv3.length; i++) {
// 	console.log(masuv3[i]);
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let masuv4 = ['o', 1, true, 'r', 't', 99, 't', false, 'd', 's']; 


// - Створити масив з 10 елементів числового, стірчкового і булев	ого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи


// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

// let block = [];
// block.length = 10;
// block[0] = 'aaa';
// block[1] = 'sss';
// block[2] = 10;
// block[3] = 154684;
// block[4] = true;
// block[5] = 54;
// block[6] = 'iii';
// block[7] = false;
// block[8] = 45;
// block[9] = 'sss';
// console.log(block);



// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i=0; i<10; i++){
// 	console.log(i);
// 	document.write(i);
// }
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// for (let i=0; i<100; i++){
// 	console.log(i);
// 	document.write(i);
// }
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i=0; i<100; i+=2){
// 	console.log(i);
// 	document.write(i);
// }
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// for (i=0; i<100; i++){
// 	if(i % 2 === 0) {
// 		console.log(i);
// 		document.write(i);
// 	}
// }

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
// for (i=0; i<100; i++){
// 	if(i % 2 === 1) {
// 		console.log(i);
// 		document.write(i);
// 	}
// }

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.

// =================
// =================
// =================
// =================

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let block = ['a', 'b', 'c'];
// block.push (1, 2, 3)
// console.log(block)
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// let block = [1, 2, 3];
// block = block.reverse();
// console.log(block);

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// let block = [1, 2, 3];
// block.push (4, 5, 6);
// console.log(block)  
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// let block = [1, 2, 3];
// block.unshift (4, 5, 6);
// console.log(block)  
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// let block = ['js', 'css', 'jq'] 
// let b = block.shift();
// console.log(b)
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// let block1 = ['js', 'css', 'jq'] 
// let a = block1.pop();
// console.log(a)

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// let block = [1, 2, 3, 4, 5];
// let b = block.slice(3);
// console.log(b)

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
let block = [1, 6, 48, 33, 4, 5, 14, 7, 21, 37]
for (i = 0; i<10; i++) {
    if (i % 2 === 0) {
    console.log();
    }
}
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.


// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,61,6,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.


// 1
//  створити пустий масив та :
// 1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
//  2. вывести на консоль  каждый третий елемент
//  3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.
//  4. вывести на консоль  каждый третий елемент
//  но при условии что он имеет парное значение и
//  записать их в другой массив.
//  5. Вывести каждый елемент массива у которого соседний с права элемент - парный
//   5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.

// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.
